In [147]:
import numpy as np
import pandas as pd

In [148]:
df = pd.DataFrame(np.random.randn(20).reshape(5 ,4))
display(df)
sampler = np.random.permutation(2)

df.take(sampler)

          0         1         2         3
0  1.854624 -0.206481  0.389895 -0.190706
1  0.365371  0.728686 -2.615213  0.782879
2  0.089382  1.404172 -0.960388 -1.227001
3 -1.431990  0.009180  0.313985 -0.768533
4 -0.132289  0.647764 -0.913016  0.661050

          0         1         2         3
1  0.365371  0.728686 -2.615213  0.782879
0  1.854624 -0.206481  0.389895 -0.190706

In [169]:
df.sample(3 ,  replace= True)

          0         1         2         3
3 -1.431990  0.009180  0.313985 -0.768533
3 -1.431990  0.009180  0.313985 -0.768533
1  0.365371  0.728686 -2.615213  0.782879

In [167]:
df

          0         1         2         3
0  1.854624 -0.206481  0.389895 -0.190706
1  0.365371  0.728686 -2.615213  0.782879
2  0.089382  1.404172 -0.960388 -1.227001
3 -1.431990  0.009180  0.313985 -0.768533
4 -0.132289  0.647764 -0.913016  0.661050

In [166]:
df.sample(3 , replace= False)

          0         1         2         3
4 -0.132289  0.647764 -0.913016  0.661050
0  1.854624 -0.206481  0.389895 -0.190706
2  0.089382  1.404172 -0.960388 -1.227001

In [106]:
df1 = pd.DataFrame({'Name':['Umer' , 'Bilal' , 'Ali' , 'Usman'],
                   'age':(np.random.randn(4))}).set_index('Name')
df1

            age
Name
Umer  -0.251932
Bilal  0.497078
Ali   -0.022434
Usman  1.192518

In [107]:
df2 = pd.DataFrame({'SName':['Umer' , 'Bilal' , 'Ali' , 'Hamza'],
                   'GPA':(np.random.randn(4))}).set_index('SName')
df2

            GPA
SName
Umer   1.263079
Bilal  1.191563
Ali    0.119615
Hamza -1.325956

In [108]:
df1.join(df2)

            age       GPA
Name
Umer  -0.251932  1.263079
Bilal  0.497078  1.191563
Ali   -0.022434  0.119615
Usman  1.192518       NaN

In [109]:
df2.join(df1)

            GPA       age
SName
Umer   1.263079 -0.251932
Bilal  1.191563  0.497078
Ali    0.119615 -0.022434
Hamza -1.325956       NaN

In [116]:
a = pd.Series([23,34,56,78] , index = ['b' , 'd' , 'a' , 'c'] )
b= pd.Series([44,67,89,90])

In [125]:
x = pd.concat([b , a] , sort = True , axis = 1)

In [126]:
x

      0     1
0  44.0   NaN
1  67.0   NaN
2  89.0   NaN
3  90.0   NaN
a   NaN  56.0
b   NaN  23.0
c   NaN  78.0
d   NaN  34.0

In [112]:
pd.concat([df1 , df2] , sort = True)

            GPA       age
Umer        NaN -0.251932
Bilal       NaN  0.497078
Ali         NaN -0.022434
Usman       NaN  1.192518
Umer   1.263079       NaN
Bilal  1.191563       NaN
Ali    0.119615       NaN
Hamza -1.325956       NaN

# Heirarchical Indexing

In [204]:
df= pd.Series(np.random.randn(10),
             index = [['Karachi','Karachi'
                      ,'Karachi','Karachi',
                      'lahore','lahore','lahore',
                      "Islamabad", "Peshware" , 'Peshware'] , 
                      ['Dhoraji','Sharfabad','Tariq Road' ,'Defence',
                      'Gulberg' ,'Iqbal Road' , 'Model Town' , 
                      'F-9' , 'Khyber' , 'Qissa khuwani Bazar']])

In [205]:
df

Karachi    Dhoraji                0.878767
           Sharfabad              1.172870
           Tariq Road            -0.099732
           Defence                2.128372
lahore     Gulberg                1.145684
           Iqbal Road            -0.506274
           Model Town            -0.813375
Islamabad  F-9                   -0.042742
Peshware   Khyber                 0.062174
           Qissa khuwani Bazar    0.349359
dtype: float64

In [174]:
df['Karachi']

Dhoraji       1.182825
Sharfabad    -0.371320
Tariq Road   -0.795583
Defence      -1.176762
dtype: float64

In [175]:
df['Karachi']['Sharfabad':'Defence']

Sharfabad    -0.371320
Tariq Road   -0.795583
Defence      -1.176762
dtype: float64

In [176]:
df['Karachi'][1:4]

Sharfabad    -0.371320
Tariq Road   -0.795583
Defence      -1.176762
dtype: float64

In [177]:
df['Karachi'].iloc[1:]

Sharfabad    -0.371320
Tariq Road   -0.795583
Defence      -1.176762
dtype: float64

In [178]:
df["Karachi"].iloc[[1,3]]

Sharfabad   -0.371320
Defence     -1.176762
dtype: float64

In [179]:
x = df.unstack()

In [180]:
df

Karachi    Dhoraji                1.182825
           Sharfabad             -0.371320
           Tariq Road            -0.795583
           Defence               -1.176762
lahore     Gulberg               -1.574369
           Iqbal Road             0.880894
           Model Town             1.516095
Islamabad  F-9                    1.162427
Peshware   Khyber                -0.323668
           Qissa khuwani Bazar    0.324375
dtype: float64

In [184]:
df.unstack().stack()

Islamabad  F-9                    1.162427
Karachi    Defence               -1.176762
           Dhoraji                1.182825
           Sharfabad             -0.371320
           Tariq Road            -0.795583
Peshware   Khyber                -0.323668
           Qissa khuwani Bazar    0.324375
lahore     Gulberg               -1.574369
           Iqbal Road             0.880894
           Model Town             1.516095
dtype: float64

In [144]:
x

,Defence,Dhoraji,F-9,Gulberg,Iqbal Road,Khyber,Model Town,Qissa khuwani Bazar,Sharfabad,Tariq Road
Islamabad,NaN,NaN,-1.403138,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Karachi,-1.519857,0.64102,NaN,NaN,NaN,NaN,NaN,NaN,-2.163223,0.610264
Peshware,NaN,NaN,NaN,NaN,NaN,1.2927,NaN,0.025905,NaN,NaN
lahore,NaN,NaN,NaN,0.084131,0.37298,NaN,0.318206,NaN,NaN,NaN

In [145]:
x.stack()

Islamabad  F-9                   -1.403138
Karachi    Defence               -1.519857
           Dhoraji                0.641020
           Sharfabad             -2.163223
           Tariq Road             0.610264
Peshware   Khyber                 1.292700
           Qissa khuwani Bazar    0.025905
lahore     Gulberg                0.084131
           Iqbal Road             0.372980
           Model Town             0.318206
dtype: float64

In [206]:
df.index.names = ['CITY' , 'AREA' ]

In [207]:
df

CITY       AREA
Karachi    Dhoraji                0.878767
           Sharfabad              1.172870
           Tariq Road            -0.099732
           Defence                2.128372
lahore     Gulberg                1.145684
           Iqbal Road            -0.506274
           Model Town            -0.813375
Islamabad  F-9                   -0.042742
Peshware   Khyber                 0.062174
           Qissa khuwani Bazar    0.349359
dtype: float64

In [208]:
#df.swaplevel('CITY' , 'AREA')

In [214]:
df.swaplevel('AREA' , 'CITY').sort_index(level= 'CITY')

AREA                 CITY
F-9                  Islamabad   -0.042742
Defence              Karachi      2.128372
Dhoraji              Karachi      0.878767
Sharfabad            Karachi      1.172870
Tariq Road           Karachi     -0.099732
Khyber               Peshware     0.062174
Qissa khuwani Bazar  Peshware     0.349359
Gulberg              lahore       1.145684
Iqbal Road           lahore      -0.506274
Model Town           lahore      -0.813375
dtype: float64

In [3]:
# Explore information about the repositories.
repo_dicts = response_dict['items']
print("Repositories returned:", len(repo_dicts))

NameError: name 'response_dict' is not defined